artillery/support-questions/commands/create_question_debug.yml
config:
  target: 'https://lemonade.leersteun.lars-acc.school'
  # Conservative timeout settings
  http:
    timeout: 60  # 60 seconds timeout
    pool: 10     # Small connection pool
  phases:
    - duration: 10s
      arrivalRate: 1  # Very low rate for debugging
      name: "Debug Support Question Create"
  environments:
    tst:
      target: 'https://lemonade.leersteun.lars-tst.school'
      http:
        timeout: 60
        pool: 10
      phases:
        - duration: 10s
          arrivalRate: 1
      payload:
        path: '../../data/tst-questions-mongo.csv'
        fields:
          - 'question_id'
          - 'school_year' 
          - 'creation_date'
          - 'student_subscription_id'
          - 'verslag_id'
          - 'school_entity_id'
          - 'learning_support_center_id'
          - 'creator_id' 
        skipHeader: true
        delimiter: ','     
    acc:
      target: 'https://lemonade.leersteun.lars-acc.school'
      http:
        timeout: 60
        pool: 10
      phases:
        - duration: 10s
          arrivalRate: 1  # Very conservative for debugging
      payload:
        - path: '../../data/acc-questions-mongo-1k.csv'
          fields:
            - 'question_id'
            - 'school_year' 
            - 'creation_date'
            - 'student_subscription_id'
            - 'verslag_id'
            - 'school_entity_id'
            - 'learning_support_center_id'
            - 'creator_id'
          skipHeader: true
          delimiter: ','
        - path: '../../data/acc-learning-support-centers.csv'
          fields:
            - 'learning_support_center_id'
            - 'name'
            - 'access_token' 
            - 'mongo_claims'
          skipHeader: true
          delimiter: ','      
  variables:
    access_token_: "{{ $env.ACCESS_TOKEN }}"
    mongo_claims_: "{{ $env.MONGO_CLAIMS }}"
  processor: '../../utils/response-logger.js'
  engines:
    http:
      extendedMetrics: true
      maxSockets: 10  # Limit concurrent connections

scenarios:
  - name: "Debug Create Support Question"
    weight: 100
    flow:
      - post:
          url: '/api/zorglink/zorglink-support-question/{{ question_id }}'
          headers:
              Content-Type: "application/json"
              Cookie: "access_token={{ access_token }}; mongo_claims={{ mongo_claims }}"
          timeout: 60000  # 60 seconds
          json:
            _id: '{{ question_id }}'
            _corr: '{{ custom_uuid }}'
            _command: "put"
            _type: "zorglink-support-question"
            questionText: 'DEBUG_LOAD_TEST'
            schoolText: 'DEBUG_LOAD_TEST'
            schoolYear: '{{ school_year }}'
            creationDate: '{{ creation_date }}'
            studentSubscriptionId: '{{ student_subscription_id }}'
            verslagId: '{{ verslag_id }}'
            schoolEntityId: '{{ school_entity_id }}'
            learningSupportCenterId: '{{ learning_support_center_id }}'
            creatorId: '{{ creator_id }}'
          beforeRequest: 'generateUuid' 
          afterResponse: 'logErrorResponse'
          expect:
            - statusCode: 
                - 200
                - 201
            - contentType: json